"""
Цей модуль визначає Об'єкти-значення (Value Objects), пов'язані зі світом гри.

Об'єкти-значення - це незмінні об'єкти, які визначаються своїми атрибутами.
Два об'єкти-значення з однаковими атрибутами вважаються однаковими.
"""
from dataclasses import dataclass

@dataclass(frozen=True)
class BaseStats:
    """
    Об'єкт-значення, що представляє базові (незмінні) характеристики персонажа.
    Використання `frozen=True` гарантує, що екземпляр цього класу не можна буде змінити
    після створення, що є ключовою властивістю об'єктів-значень.
    """
    strength: int
    dexterity: int
    intelligence: int
    base_health: int
    base_mana: int